// <img> tag example (change "1b" to target) : <br/><div style="display: flex;justify-content: center;"}><img src="/blogs/1b.png" alt="1b" /></div>

export const myBlogs = [
  {
    blogCate: "命盤小知識",
    cateTitle: "命盤小知識",
    blogs: [
      {
        blogId: "偏財運強的命盤特徵",
        blogTitle: "偏財運強的命盤特徵",
        contentHtmls: [
          "在星軌理數中，主要的偏財星有三顆，分別是「破軍」、「貪狼」、「廉貞」。如果有果報的宮位，化偏財星的祿，會有偏財運好的跡象。",
          "果報宮分別有福德宮、子女宮、夫妻宮、遷移宮。其中福德宮和遷移宮的力量最強。",
          "所以，如果你有以下特徵，就代表偏財運強，容易中獎：",
          '1. 生年偏財星祿 (破 / 廉 / 貪) 坐福德宮<br/><div style="display: flex;justify-content: center;"}><img src="/blogs/1a.png" alt="1a" /></div>',
          '2. 福德宮化偏財星祿 (破 / 廉 / 貪)<br/><div style="display: flex;justify-content: center;"}><img src="/blogs/1b.png" alt="1b" /></div>',
          '3. 遷移宮化偏財星祿 (破 / 廉 / 貪)<br/><div style="display: flex;justify-content: center;"}><img src="/blogs/1c.png" alt="1c" /></div>',
          '大家可以排盤看看，自己有沒有以上結構。<a href="/chart" target="_blank">排盤連結</a>',
          "但即使偏財運強，也建議理性投資 / 賭博，小賭怡情！",
        ],
      },
    ],
  },

  {
    blogCate: "十二宮位介紹",
    cateTitle: "十二宮位介紹",
    blogs: [
      {
        blogId: "命宮",
        blogTitle: "命宮",
        contentHtmls: [
          "命宮在十二宮位中極為重要，它代表一個人的思維核心和內心世界。",
          "首先，命宮與一個人的「思想」息息相關，這些思想直接影響到個體的「精神狀態」和「意志力」。隨著時間的推移及經歷的累積，這些思想會逐漸轉化成一種固定的思考模式，即我們所謂的「思考方法」。",
          "這種思考方法或思維慣性進一步塑造了一個人的「性格」和「個性」。性格和個性則明顯影響了個體對於外界人事物的「喜好」。",
          "再進一步，從一個人的個性表現中，我們可以觀察到其對不同情況的「情緒反應」。",
          "因此，在紫微斗數中，命宮不僅是理解一個人的「心之所向」和「主導思考」的關鍵，它還涵蓋了「思想」、「精神」與「意志」。總而言之，命宮是性格、喜好以及情緒反應的展現之地。",
        ],
      },
    ],
  },

  {
    blogCate: "雜談",
    cateTitle: "雜談",
    blogs: [
      {
        blogId: "術數與靈感",
        blogTitle: "術數與靈感",
        contentHtmls: [
          "術數通常是透過計數與邏輯推演來描述一個人的現狀及未來趨勢，甚至提出改善建議。術數涵蓋了多種類型，如占卜、命理、風水和中醫等。是的，中醫亦可視為一種術數，它同樣基於陰陽五行的理論來進行診斷與治療。",
          "而靈感與通靈則指的是透過直覺或與超自然力量的溝通來獲得信息。無論是東方還是西方，這樣的技術形式多種多樣，有的依靠個人直覺或突發的靈感（通常稱為靈感），有的則是與其他能量或靈體進行溝通，如通神、通靈或與惡魔接觸等。高階的術士甚至能看到非常細膩的畫面或親身感受到某些情境。",
          "若想了解個人相關事宜，應該選擇哪一種？術數與靈感的比較：",
          "術數提供一種相對穩定的技術，其準確度取決於術數的完整性及實施者的熟練程度。若操作正確，通過術數得出的建議通常是精確且適合個人的。然而，與靈感類技術相比，術數的細節程度可能有限。",
          "通靈則是一種較不穩定的技術，其效果極大依賴於實施者當時的狀態以及外界資訊的影響。有時候外在環境，如磁場的問題，或者接收到錯誤的信息，都可能影響準確度。但在條件理想的情況下，通靈可以提供極為精確的信息。",
          "因此，有些師父會同時使用術數與靈感技術來豐富和完整解讀。這種結合方法的缺點是技術傳承較為困難。",
          "最終的選擇取決於個人的興趣和緣分。如果你尋求一個穩定且可靠的方法來提升個人生活，改善生活環境，術數可能更適合你。若你希望深入了解過去的事件或尋求心靈上的慰藉，則可考慮尋求通靈或靈感類的服務。",
          "不論選擇哪種方式，選擇一位可信且技術嫻熟的師父是非常關鍵的，畢竟市場上不乏技術粗糙甚至施行欺詐的人士。務必謹慎選擇。",
        ],
      },
    ],
  },

];
